---
type: FilteredWorksetIdIterator
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# FilteredWorksetIdIterator

`Autodesk.Revit.DB.FilteredWorksetIdIterator` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCurrent | 2012 | `public WorksetId GetCurrent ()` |
| Method | IsDone | 2012 | `public virtual bool IsDone ()` |
| Method | MoveNext | 2012 | `public virtual bool MoveNext ()` |
| Method | Reset | 2012 | `public virtual void Reset ()` |
| Property | Current | — | `public virtual WorksetId Current { get ; }` |
| Property | CurrentObject | — | `internal Object CurrentObject { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |